AlexM-dev/RoboCup-STM32/Lightweight/src/main/main.cpp
				int speedBack = 256 * 0.9;
				gyroFlag = 0;				
				math.setVector(0, 0);
				//tsop.setGyroAng(0);
				gyro.setMaxSpeed(256);
				dribblerOn = 0;
				cam.setGyroAng(gyro.getDev());
				if (startMovingFlag == 0) {
					if (kickState == 0) {
						kickSector = 0;
						if (cam.getAnotherCamDist() != 0) {
							gyro.setRotation(180 + cam.getAnotherCamAngle());
						} else { 
							gyro.setRotation(180);
						}
						 
						if (tsop.isCanSee() || ballCathed) {
							if (ballCathed) {
								if (goBackFlag == 0) {
									goBackFlag = 1;
									goBackTimer = millis();
								} else {
									gyro.setMaxSpeed(50);
									math.setVector(180, (millis() - goBackTimer) / 6 > speedBack ? speedBack : (millis() - goBackTimer) / 6);
								}								
								dribblerOn = 2;
								if (cam.getAnotherCamDist() != 0 && abs(cam.getAnotherCamDist() * cos(cam.getAnotherCamAngle() / 57.3)) < 80) {
									if (millis() - goBackTimer < 200) {
										mKick = 1;
									} else {
										mKick = 0;
									}
									kickTimer = millis();
									kickState = 1;
								}
							} else {
								goBackFlag = 0;
								if (abs(float(tsop.getAngle())) < 90) {
										dribblerOn = 2;
								}
								if (tsop.getDist() > BALL_IS_NEAR) {
									if (abs(float(tsop.getAngle())) < 90) {
										math.setVector(tsop.getAngle() + AngleOffset(tsop.getAngle(), tsop.getDist()), speedSlow);
									} else {
										math.setVector(tsop.getAngle() + AngleOffset(tsop.getAngle(), tsop.getDist()), speedFast);
									}
									//getFRWSpeed(tsop.getAngle(), speedFast, speedSlow));
								} else {
									math.setVector(tsop.getAngle() + AngleOffset(tsop.getAngle(), tsop.getDist()), speedFastFast);
								}
							}
						} else {
							math.setVector(0, 0);
						}
					} else {
						if (cam.getAnotherCamDist() != 0 && abs(cam.getAnotherCamDist() * cos(cam.getAnotherCamAngle() / 57.3)) > 80) {
							kickState = 0;
							continue;
						}
						dribblerOn = 2;
						if (cam.getAnotherCamDist() != 0) {
							gyro.setRotation(180 + cam.getAnotherCamAngle());
						} else {
							gyro.setRotation(180);
						}
						
						if (millis() - kickTimer > 1000) {
							kickState = 0;
							dribblerOn = 0;
							kickSector = 0;
							ballCathed = 0;
						} else {
							if (kickState == 1) {
								int dY = cam.getAnotherCamDist() * sin(cam.getAnotherCamAngle() / 57.3);
								int dX = cam.getAnotherCamDist() * cos(cam.getAnotherCamAngle() / 57.3);
								if (abs(float(cam.getAnotherCamAngle())) > 30) {
										if (dY < 0) {
											kickSector = 1;
										} else {
											kickSector = 6;
										}
								} else {
									if (dY < -30) {
										kickSector = 2;
									} else if (dY < 0) {
										kickSector = 3;
									} else if (dY < 30) {
										kickSector = 4;
									} else {
										kickSector = 5;
									}
								}
								kickState = 2;
								
								if (mKick == 1) {
									goBackTimer = millis();
								}
							} else if (kickState == 2) {
								if (millis() - goBackTimer < 350) {
									gyro.setRotation(180 + cam.getAnotherCamAngle());
								} else {
									dribblerOn = 2;
									switch(kickSector) {
									case 1:
										gyro.setRotation(-25 + cam.getAnotherCamAngle());
										break; 
									case 2:
										gyro.setRotation(25 + cam.getAnotherCamAngle());
										break;
									case 3:
										gyro.setRotation(25 + cam.getAnotherCamAngle());
										break;
									case 4:
										gyro.setRotation(-25 + cam.getAnotherCamAngle());
										break;
									case 5:
										gyro.setRotation(-25 + cam.getAnotherCamAngle());
										break;
									case 6:
										gyro.setRotation(25 + cam.getAnotherCamAngle());
										break;
									}
								}
							}
						}
					}
				} else {
					gyro.setRotation(0);
					if (tsop.getDist() > BALL_IS_NEAR) {
						if (abs(float(tsop.getAngle())) < 90) {
							math.setVector(tsop.getAngle() + AngleOffset(tsop.getAngle(), tsop.getDist()), speedSlow);
						} else {
							math.setVector(tsop.getAngle() + AngleOffset(tsop.getAngle(), tsop.getDist()), speedFast);
						}
					} else {
						math.setVector(tsop.getAngle() + AngleOffset(tsop.getAngle(), tsop.getDist()), speedFastFast);
					}
					dribblerOn = 2;
					if (millis() - startMovingTimer > 5000 || ballCathed) {
						startMovingFlag = 0;
					}
				}
				
				int autX = 55;
					
					if (cam.getCamDist() != 0) {
						if(abs(cam.getCamDist() * sin(cam.getCamAngle() / 57.3)) > 50 || abs(cam.getCamDist() * cos(cam.getCamAngle() / 57.3)) < 40)
						{
							if (math.getSpeed() > 150) {
								math.setSpeed(150);
							}
						}
						
						if(abs(cam.getCamDist() * sin(cam.getCamAngle() / 57.3)) < 40) {
							if(abs(cam.getCamDist() * cos(cam.getCamAngle() / 57.3)) < 40)  
							{
								math.setVector(0 - gyro.getTargetRobotAngle(), speedFast);
							}
						}
						
						if(abs(cam.getCamDist() * cos(cam.getCamAngle() / 57.3)) < 20)  
						{
							math.setVector(0 - gyro.getTargetRobotAngle(), speedFast);
						}
			
						if(cam.getCamDist() * sin(cam.getCamAngle() / 57.3) > autX)
						{
							math.addVector(90 - gyro.getTargetRobotAngle(), math.getSpeed() + speedFast);
						}
						if(cam.getCamDist() * sin(cam.getCamAngle() / 57.3) < -autX)
						{
							math.addVector(-90 - gyro.getTargetRobotAngle(), math.getSpeed() + speedFast);
						}
					}
					
					if (cam.getAnotherCamDist() != 0) {
						if(abs(cam.getAnotherCamDist() * sin(cam.getAnotherCamAngle() / 57.3)) > 50 || abs(cam.getAnotherCamDist() * cos(cam.getAnotherCamAngle() / 57.3)) < 40)
						{
							if (math.getSpeed() > 150) {
								math.setSpeed(150);
							}
						}
						
						if(abs(cam.getAnotherCamDist() * cos(cam.getAnotherCamAngle() / 57.3)) < 20)  
						{
							math.setVector(180 - gyro.getTargetRobotAngle(), speedFast);
						}
						if(cam.getAnotherCamDist() < 40)  
						{
							if(abs(float(cam.getAnotherCamAngle())) > 45) {
								math.addVector((180 + cam.getAnotherCamAngle()) - gyro.getTargetRobotAngle(), math.getSpeed() + speedSlow);
							} else {
								math.addVector(180 - gyro.getTargetRobotAngle(), math.getSpeed() + speedSlow);
							}
						}
						
