AlexM-dev/RoboCup-STM32/Lightweight/src/main/main.cpp
						if(cam.getAnotherCamDist() * sin(cam.getAnotherCamAngle() / 57.3) < -autX)  
						{
							math.addVector(-90 - gyro.getTargetRobotAngle(), math.getSpeed() + speedSlow);
						}
						if(cam.getAnotherCamDist() * sin(cam.getAnotherCamAngle() / 57.3) > autX)  
						{
							math.addVector(90 - gyro.getTargetRobotAngle(), math.getSpeed() + speedSlow);
						}
					}
				//math.setVector(0, 0);
				//gyro.setRotation(180);
				k = gyro.getAngle();
				//kickSector = 2;
				//dribblerOn = 2;
			} else if (CODE == GOALKEEPER) {
				int speedGK = 230; 			
				int speedGKSlow = 230; 							
				math.setVector(0, 0);
				int angAng = 130;
				int tAng = 0;
				if (abs(float(tsop.getAngle())) > 90) {
					tAng = FAng(-tsop.getAngle()); 
				} else {
					tAng = FAng(tsop.getAngle() - cam.getCamAngle()); 
				}
				
				int yCoord = abs(cam.getCamDist() * cos(cam.getCamAngle() / 57.3));

				math.setVector(0, 0);
				gyro.setMaxSpeed(256);
				dribblerOn = 0;
				cam.setGyroAng(gyro.getDev());
				
				
				if(tsop.isCanSee()){
					if (abs(float(tAng)) < 170 || abs(float(tAng)) > 10) {
						if (abs(float(cam.getCamAngle())) > angAng) {
							if (tAng < 0) {
								math.setVector(90, getGKSpeed(tAng, speedGK));
							} else {
								math.setVector(-90, getGKSpeed(tAng, speedGK));
							}
						} else {
							if (tAng < 0) {
								if (cam.getCamAngle() < 0) {
									math.setVector(cam.getCamAngle() - 90, getGKSpeed(tAng, math.min(speedGK, speedGK * yCoord / 40)));
								} else {
									math.setVector(cam.getCamAngle() - 90, getGKSpeed(tAng, speedGK));
								}
							} else {
								if (cam.getCamAngle() > 0) {
									math.setVector(cam.getCamAngle() + 90, getGKSpeed(tAng, math.min(speedGK, speedGK * yCoord / 40)));
								} else {
									math.setVector(cam.getCamAngle() + 90, getGKSpeed(tAng, speedGK));
								}
							}
							if (yCoord < 20) {//(abs(float(cam.getCamAngle())) < 130) {
								if (cam.getCamAngle() < 0 && tAng < 0) {
									math.setVector(0, 0);
								}
								if (cam.getCamAngle() > 0 && tAng > 0) {
									math.setVector(0, 0);
								}
							}
						}
					} else {
						math.setVector(0, 0);
					}
				} else {
					if (abs(float(cam.getCamAngle())) < 170) {
						if (cam.getCamAngle() > 0) {
							math.setVector(cam.getCamAngle() - 90, speedGKSlow);
						} else {
							math.setVector(cam.getCamAngle() + 90, speedGKSlow);
						}
					} else {
						math.setVector(0, 0);
					}
				}
				
				//STOP FLAGS
				/*if (yCoord < 30) { //(abs(float(cam.getCamAngle())) < 130) {
					if((abs(double(cam.getCamAngle())) > 90 && tsop.getDist() > 50) && tAng < 0) {
						math.setVector(0, 0);
					}
					if((abs(double(cam.getCamAngle())) > 90 && tsop.getDist() > 50) && tAng > 0) {
						math.setVector(0, 0);
					}
				}*/
				
				if(tsop.isCanSee()) {
					if (abs(float(tAng)) > 160 && tsop.getDist() > 70 && abs(float(tsop.getAngle())) < 90) { 
						if (gkGo == 0) { 
							gkGo = 1;
							timer = millis();
						}
						if (gkGo == 1 && millis() - timer > 6000) { 
							gkGo = 2;
							timer = millis();
							temptAng = tAng + 180;
						}
						if (gkGo == 2 && millis() - timer < 6500) { 
							math.setVector(temptAng, 200);
						}
						if (gkGo == 2 && millis() - timer >= 6500) { 
							gkGo = 0;
						}
					}
				}

				if (gkGo != 2) {
					if (abs(float(cam.getCamAngle())) > angAng) {	
						if (yCoord > 25) {
							math.addVector(180, getGKSpeedSlow(yCoord - 25, speedGK));
						} else {
							math.addVector(0, getGKSpeedSlow(yCoord - 25, speedGK));
						}
					} else {
						if (cam.getCamDist() > 40) {
							math.addVector(cam.getCamAngle(), getGKSpeedSlow(cam.getCamDist() - 40, speedGK));	
						} else {
							math.addVector(cam.getCamAngle() + 180, getGKSpeedSlow(cam.getCamDist() - 40, speedGK));
						}
					}
				} else {
					if(cam.getAnotherCamDist() * sin(cam.getAnotherCamAngle() / 57.3) < -50)  
					{
						math.addVector(-90 - gyro.getTargetRobotAngle(), math.getSpeed() + 100);
					}
					if(cam.getAnotherCamDist() * sin(cam.getAnotherCamAngle() / 57.3) > 50)  
					{
						math.addVector(90 - gyro.getTargetRobotAngle(), math.getSpeed() + 100);
					}
					if (abs(cam.getCamDist() * sin(cam.getCamAngle() / 57.3)) > 40 || tsop.getDist() < 30 || abs(cam.getCamDist() * cos(cam.getCamAngle() / 57.3)) > 70) {
						gkGo = 0;
					}
				}
				
				if (yCoord < 10) {
					math.setVector(0, speedGK);
				} 
				
				testAng = tAng;
				//math.setVector(0, 0);
				k = gyro.getAngle();
			} else if (CODE == DEBUG) {
				/*dribblerOn = 0;
				if (tsop.isCanSee()) {
					if (tsop.getDist() > BALL_IS_REALLY_NEAR) {
						dribblerOn = 2;
					} else if (tsop.getDist() > BALL_IS_NEAR) {
						dribblerOn = 1;
					}
				}*/
			} else if (CODE == SNIPER) {
				int speed = 256 * 0.4;
				gyroFlag = 0;				
				math.setVector(0, 0);
				gyro.setMaxSpeed(256);
				dribblerOn = 0;
				cam.setGyroAng(gyro.getDev());
				gyro.setRotation(180);
				
				if (kickState == 0) {					 
					if (tsop.isCanSee() || ballCathed) {
						if (ballCathed) {
							float dX = cam.getCamDist() * sin(cam.getCamAngle() / 57.3);
							float dY = abs(cam.getCamDist() * cos(cam.getCamAngle() / 57.3));
							gyro.setMaxSpeed(50);
							math.setVector(cam.getAnotherCamAngle() > 0 ? -90 : 90, getSpeedChalandge(cam.getAnotherCamAngle(), speed));
							if (dY > 70) {
								math.addVector(0, getSpeedChalandge(abs(70. - dY), speed));
							} else {
								math.addVector(180, getSpeedChalandge(abs(70. - dY), speed));
							}
							dribblerOn = 2;
							
							if (abs(70 - dY) < 1 && abs(float(cam.getAnotherCamAngle())) < 1) {
								kickTimer = millis();
								kickState = 1;
								pwm = 260;
							}
							
							if (math.getSpeed() > speed) {
								math.setSpeed(speed);
							}
						} else {
							dribblerOn = 2;
							math.setVector(tsop.getAngle() + AngleOffset(tsop.getAngle(), tsop.getDist()), speed);
						}
					} else {
						math.setVector(0, 0);
					}
				} else {
					if (millis() - kickTimer < 1000) {
						//dribblerOn = 3;
						//pwm = 260 - (millis() - kickTimer) / 5;
						math.setVector(0, 0);
						dribblerOn = 2;
					} else if (millis() - kickTimer < 1100) {
						math.setVector(0, 0);
						dribblerOn = 0;
					} else if (millis() - kickTimer < 2000) {
						math.setVector(90, 250);
					} else {
						math.setVector(0, 0);
					}
				}
				k = gyro.getAngle();
			} else if (CODE == PENALTY) {
				int speed = 256 * 0.4;
				gyroFlag = 0;				
				math.setVector(0, 0);
				gyro.setMaxSpeed(256);
				dribblerOn = 0;
				cam.setGyroAng(gyro.getDev());
				gyro.setRotation(0);
				
				if (kickState == 0) {					 
					if (tsop.isCanSee() || ballCathed) {
						if (ballCathed) {
							gyro.setRotation(180 + cam.getAnotherCamAngle());
							gyro.setMaxSpeed(70);
							dribblerOn = 2;
							if(gyro.getDevFromTarget() < 5) {
								kickState = 1;
								kickTimer = millis();
							}
						} else {
							dribblerOn = 2;
							math.setVector(tsop.getAngle() + AngleOffset(tsop.getAngle(), tsop.getDist()), speed);
						}
					} else {
						math.setVector(0, 0);
					}
				} else {
						dribblerOn = 2;
						gyro.setRotation(180 + cam.getAnotherCamAngle());
						gyro.setMaxSpeed(70);
						if (kickState == 1) {
							if(gyro.getDevFromTarget() >= 5) {
									kickState = 0;
									continue;
							}
							if (millis() - kickTimer > 1000) {
								kickState = 2;
								kickTimer = millis();
							}
						} else {
							
