AlexM-dev/RoboCup-STM32/Lightweight/src/main/main.cpp
						}
						
						if (millis() - kickTimer > 1000) {
							kickState = 0;
							dribblerOn = 0;
							kickSector = 0;
							ballCathed = 0;
							math.setVector(0, 0);
						} else {
							if (kickState == 1) {
								int dY = cam.getAnotherCamDist() * sin(cam.getAnotherCamAngle() / 57.3);
								int dX = cam.getAnotherCamDist() * cos(cam.getAnotherCamAngle() / 57.3);
								if (abs(float(cam.getAnotherCamAngle())) > 30) {
										if (dY < 0) {
											kickSector = 1;
										} else {
											kickSector = 6;
										}
								} else {
									if (dY < -30) {
										kickSector = 2;
									} else if (dY < 0) {
										kickSector = 3;
									} else if (dY < 30) {
										kickSector = 4;
									} else {
										kickSector = 5;
									}
								}
								kickState = 2;
								
								if (mKick == 1) {
									goBackTimer = millis();
								}
							} else if (kickState == 2) {
								if (millis() - goBackTimer < 350) {
									gyro.setRotation(180 + cam.getAnotherCamAngle());
								} else {
									dribblerOn = 2;
									switch(kickSector) {
									case 1:
										gyro.setRotation(-25 + cam.getAnotherCamAngle());
										break; 
									case 2:
										gyro.setRotation(25 + cam.getAnotherCamAngle());
										break;
									case 3:
										gyro.setRotation(25 + cam.getAnotherCamAngle());
										break;
									case 4:
										gyro.setRotation(-25 + cam.getAnotherCamAngle());
										break;
									case 5:
										gyro.setRotation(-25 + cam.getAnotherCamAngle());
										break;
									case 6:
										gyro.setRotation(25 + cam.getAnotherCamAngle());
										break;
									}
								}
							}
						}
				}
				k = gyro.getAngle();
			}
		} else {
			//dribbler.pwm(90);
			math.setVector(0, 0);
			timer = 0;
			f = false;
			k = 0;
			testAng = tsop.getDist();
			kickSector = 0;
			kickState = 0;
		}		
		if (dribblerOn == 0) {
			dribbler.pwm(120);
		} else if (dribblerOn == 1) {
			dribbler.pwm(260);
		} else if (dribblerOn == 2) {
			dribbler.pwm(260);
		} else if (dribblerOn == 3) {
			dribbler.pwm(pwm);
		}
		math.calculateSpeed(math.getAngle(), math.getSpeed(), sp1, sp2, sp3, sp4);
		
		if (kickSector == 0) {
			robot.move(sp1 + k, sp2 + k, sp3 + k, sp4 + k, math.getPeriod());
		} else {
			if (kickSector == 1 || kickSector == 6) {
				gyro.setMaxSpeed(160);
				k = gyro.getRotationKForRotateToBall(5, 3, 0.1);
			} else {
				gyro.setMaxSpeed(180);
				k = gyro.getRotationKForRotateToBall(3, 1.6, 0.05);
			}
			robot.move(sp1 + k, sp2 + k, sp3 + k, sp4 + k, math.getPeriod());
		}
	}
}